In [14]:
import pandas as pd

df = pd.read_csv("../datasets/bmw_sales.csv") ##reading the files

df.head() ##first few rows

,Model,Year,Region,Color,Fuel_Type,Transmission,Engine_Size_L,Mileage_KM,Price_USD,Sales_Volume,Sales_Classification
0,5 Series,2016,Asia,Red,Petrol,Manual,3.5,151748,98740,8300,High
1,i8,2013,North America,Red,Hybrid,Automatic,1.6,121671,79219,3428,Low
2,5 Series,2022,North America,Blue,Petrol,Automatic,4.5,10991,113265,6994,Low
3,X3,2024,Middle East,Blue,Petrol,Automatic,1.7,27255,60971,4047,Low
4,7 Series,2020,South America,Black,Diesel,Manual,2.1,122131,49898,3080,Low

In [3]:
df.tail() ##last few rows

,Model,Year,Region,Color,Fuel_Type,Transmission,Engine_Size_L,Mileage_KM,Price_USD,Sales_Volume,Sales_Classification
49995,i3,2014,Asia,Red,Hybrid,Manual,4.6,151030,42932,8182,High
49996,i3,2023,Middle East,Silver,Electric,Manual,4.2,147396,48714,9816,High
49997,5 Series,2010,Middle East,Red,Petrol,Automatic,4.5,174939,46126,8280,High
49998,i3,2020,Asia,White,Electric,Automatic,3.8,3379,58566,9486,High
49999,X1,2020,North America,Blue,Diesel,Manual,3.3,171003,77492,1764,Low

In [ ]:
df.index ##the index of the db. where to start, where to end, how many step in between

RangeIndex(start=1, stop=20, step=2)

In [ ]:
df.columns ##the columns title of the db

Index(['Model', 'Year', 'Region', 'Color', 'Fuel_Type', 'Transmission',
       'Engine_Size_L', 'Mileage_KM', 'Price_USD', 'Sales_Volume',
       'Sales_Classification'],
      dtype='object')

In [ ]:
df.shape ##rows x columns

(50000, 11)

In [ ]:
df.info() ##info about the db (column, non-null count, data type, memory usage, index)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Model                 50000 non-null  object
 1   Year                  50000 non-null  int64
 2   Region                50000 non-null  object
 3   Color                 50000 non-null  object
 4   Fuel_Type             50000 non-null  object
 5   Transmission          50000 non-null  object
 6   Engine_Size_L         50000 non-null  float64
 7   Mileage_KM            50000 non-null  int64
 8   Price_USD             50000 non-null  int64
 9   Sales_Volume          50000 non-null  int64
 10  Sales_Classification  50000 non-null  object
dtypes: float64(1), int64(4), object(6)
memory usage: 4.2+ MB

In [23]:
df.describe()

               Year  Engine_Size_L     Mileage_KM      Price_USD  Sales_Volume
count  50000.000000   50000.000000   50000.000000   50000.000000  50000.000000
mean    2017.015700       3.247180  100307.203140   75034.600900   5067.514680
std        4.324459       1.009078   57941.509344   25998.248882   2856.767125
min     2010.000000       1.500000       3.000000   30000.000000    100.000000
25%     2013.000000       2.400000   50178.000000   52434.750000   2588.000000
50%     2017.000000       3.200000  100388.500000   75011.500000   5087.000000
75%     2021.000000       4.100000  150630.250000   97628.250000   7537.250000
max     2024.000000       5.000000  199996.000000  119998.000000   9999.000000

In [ ]:
df['Region']
##A db is basically a big ass dictionary (part of it is) so in order to access it, use dictionary accessing method to access columns

0                 Asia
1        North America
2        North America
3          Middle East
4        South America
             ...
49995             Asia
49996      Middle East
49997      Middle East
49998             Asia
49999    North America
Name: Region, Length: 50000, dtype: object

In [37]:
df['Year'].value_counts()

Year
2022    3478
2024    3427
2019    3392
2021    3372
2016    3365
2015    3358
2014    3350
2012    3332
2010    3330
2013    3326
2017    3290
2011    3278
2018    3278
2023    3219
2020    3205
Name: count, dtype: int64

In [ ]:
df.iloc[[100, 200, 300]] ##accessing multiple rows

,Model,Year,Region,Color,Fuel_Type,Transmission,Engine_Size_L,Mileage_KM,Price_USD,Sales_Volume,Sales_Classification
100,3 Series,2011,Middle East,Red,Hybrid,Automatic,4.0,22280,55612,6698,Low
200,X1,2014,Europe,Blue,Hybrid,Manual,3.1,48040,77484,9106,High
300,X6,2020,Asia,Black,Hybrid,Automatic,3.8,45712,90061,4643,Low

In [ ]:
df.iloc[[400, 500, 600], 1] ##accessing specific rows and columns

400    2010
500    2011
600    2024
Name: Year, dtype: int64